In [271]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [272]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: root@bank'

# Lesson 3.7: Correlated subqueries & Rolling Calculations

### Lesson Duration: 3 hours

> Purpose: The purpose of this lesson is to dive deeper into correlated subqueries and write more complex queries with `join` statements and subqueries. We will also talk more about `lag_functions`, `self joins` and how it can be used to perform rolling calculations. We will also revisit logistic regression and go in details on how the algorithm works to make those classifications.

---

### Setup

- All previous set up

### Learning Objectives

After this lesson, students will be able to:

- Write more complex correlated subqueries
- Use `self joins` to perform rolling calculations - some examples:

  - Month on month change for monthly active users (MAU)
  - Number of retained users per month
  - Number of users that did not come back this month (churned users)

- Differentiate _binary classification_ and _multi-class classification_ problems

- Interpret how the logistic regression algorithm uses loss function, optimization method, sigmoid function to predict classes

---

### Lesson 1 key concepts

> :clock10: 20 min

More examples on correlated subqueries.

- Write a query to find the month on month monthly active users (MAU)
- Use **lag()** function to get the active users in the previous month

To get this information we will proceed step by step.

Step 1: Get the account_id, date, year, month and month_number for every transaction.

In [381]:
%%sql
select * from bank.trans limit 2

 * mysql+pymysql://root:***@localhost/bank
2 rows affected.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, '', '', 0),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, '', '', 0)]

In [382]:
%%sql
create or replace view user_activity as
select account_id, convert(date, date) as Activity_date,
date_format(convert(date,date), '%M') as Activity_Month,
date_format(convert(date,date), '%m') as Activity_Month_number,
date_format(convert(date,date), '%Y') as Activity_year
from bank.trans;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [383]:
%%sql
-- Checking the results
select * from bank.user_activity
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(2378, datetime.date(1993, 1, 1), 'January', '01', '1993'),
 (576, datetime.date(1993, 1, 1), 'January', '01', '1993'),
 (704, datetime.date(1993, 1, 1), 'January', '01', '1993'),
 (3818, datetime.date(1993, 1, 1), 'January', '01', '1993'),
 (1972, datetime.date(1993, 1, 2), 'January', '01', '1993'),
 (2632, datetime.date(1993, 1, 2), 'January', '01', '1993'),
 (1539, datetime.date(1993, 1, 3), 'January', '01', '1993'),
 (2484, datetime.date(1993, 1, 3), 'January', '01', '1993'),
 (1695, datetime.date(1993, 1, 3), 'January', '01', '1993'),
 (793, datetime.date(1993, 1, 3), 'January', '01', '1993')]

Step 2: Computing the total number of active users by Year and Month with group by
and sorting according to year and month NUMBER.

In [384]:
%%sql
select Activity_year, Activity_Month, count(account_id) as Active_users from bank.user_activity
group by Activity_year, Activity_Month
order by Activity_year asc, Activity_Month_number asc
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 165),
 ('1993', 'February', 360),
 ('1993', 'March', 604),
 ('1993', 'April', 821),
 ('1993', 'May', 1166),
 ('1993', 'June', 1641),
 ('1993', 'July', 2059),
 ('1993', 'August', 2489),
 ('1993', 'September', 2892),
 ('1993', 'October', 3363)]

Step 3: Storing the results on a view for later use.

In [385]:
%%sql
drop view if exists bank.monthly_active_users;

create view bank.monthly_active_users as
select 
   Activity_year, 
   Activity_Month, 
   Activity_Month_number, 
   count(account_id) as Active_users 
from bank.user_activity
group by Activity_year, Activity_Month
order by Activity_year asc, Activity_Month_number asc;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [386]:
%%sql 
-- Checking results
select * from monthly_active_users
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', '01', 165),
 ('1993', 'February', '02', 360),
 ('1993', 'March', '03', 604),
 ('1993', 'April', '04', 821),
 ('1993', 'May', '05', 1166),
 ('1993', 'June', '06', 1641),
 ('1993', 'July', '07', 2059),
 ('1993', 'August', '08', 2489),
 ('1993', 'September', '09', 2892),
 ('1993', 'October', '10', 3363)]

Step 4: Compute the difference of `active_users` between one month and the previous one
for each year using the lag function with lag = 1 (as we want the lag from one previous record)

In [387]:
%%sql
select 
   Activity_year, 
   Activity_month,
   Active_users, 
   lag(Active_users, 1) over (order by Activity_year, Activity_Month_number) as Last_month
from monthly_active_users
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 165, None),
 ('1993', 'February', 360, 165),
 ('1993', 'March', 604, 360),
 ('1993', 'April', 821, 604),
 ('1993', 'May', 1166, 821),
 ('1993', 'June', 1641, 1166),
 ('1993', 'July', 2059, 1641),
 ('1993', 'August', 2489, 2059),
 ('1993', 'September', 2892, 2489),
 ('1993', 'October', 3363, 2892)]

Final step: Refining the query. Getting the difference of monthly active_users month to month.

In [388]:
%%sql

with cte_view as (select 
   Activity_year, 
   Activity_month,
   Active_users, 
   lag(Active_users,1) over (order by Activity_year, Activity_Month_number) as Last_month
from monthly_active_users)

select 
   Activity_year, 
   Activity_month, 
   Active_users, 
   Last_month, 
   (Active_users - Last_month) as Difference 
from cte_view
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 165, None, None),
 ('1993', 'February', 360, 165, 195),
 ('1993', 'March', 604, 360, 244),
 ('1993', 'April', 821, 604, 217),
 ('1993', 'May', 1166, 821, 345),
 ('1993', 'June', 1641, 1166, 475),
 ('1993', 'July', 2059, 1641, 418),
 ('1993', 'August', 2489, 2059, 430),
 ('1993', 'September', 2892, 2489, 403),
 ('1993', 'October', 3363, 2892, 471)]

# 3.07 Activity 1

Keep working on the `bank` database.

Modify the previous query to obtain the percentage of variation in the number of users compared with previous month.

In [389]:
%%sql
-- the previous query:
with cte_activity as (
  select Active_users, lag(Active_users, 1) over (partition by Activity_year) as last_month, 
    Activity_year, 
    Activity_month,
    Activity_Month_number
  from Monthly_active_users
)
select * from cte_activity
where last_month is not null
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(360, 165, '1993', 'February', '02'),
 (604, 360, '1993', 'March', '03'),
 (821, 604, '1993', 'April', '04'),
 (1166, 821, '1993', 'May', '05'),
 (1641, 1166, '1993', 'June', '06')]

### Solution

In [390]:
%%sql
with cte_activity as (
  select Active_users, lag(Active_users, 1) over (partition by Activity_year) as last_month, 
    Activity_year, 
    Activity_month,
    Activity_Month_number
  from Monthly_active_users
)
select *, round((Active_users - last_month) / last_month * 100, 1) as User_growth_percentage
from cte_activity
where last_month is not null
limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(360, 165, '1993', 'February', '02', Decimal('118.2')),
 (604, 360, '1993', 'March', '03', Decimal('67.8')),
 (821, 604, '1993', 'April', '04', Decimal('35.9')),
 (1166, 821, '1993', 'May', '05', Decimal('42.0')),
 (1641, 1166, '1993', 'June', '06', Decimal('40.7'))]

### Lesson 2 key concepts

> :clock10: 20 min

Use `self joins` to perform rolling calculations - some examples

- Number of retained users per month

So far we computed the total number of customers (transctions that have recurrent customers), but we are interested in the UNIQUE customer
variation month to month. In other words, how many unique customers keep renting from month
to month? (customer_id present in one month and in the next one).

Let's go again step by step.

Step1: Getting the total number of UNIQUE active customers for each year-month.

In [391]:
%%sql
select 
   distinct account_id as Active_id, 
   Activity_year, 
   Activity_month, 
   Activity_month_number 
from bank.user_activity
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(2378, '1993', 'January', '01'),
 (576, '1993', 'January', '01'),
 (704, '1993', 'January', '01'),
 (3818, '1993', 'January', '01'),
 (1972, '1993', 'January', '01'),
 (2632, '1993', 'January', '01'),
 (1539, '1993', 'January', '01'),
 (2484, '1993', 'January', '01'),
 (1695, '1993', 'January', '01'),
 (793, '1993', 'January', '01')]

Step 2: Create a view with the previous information

In [392]:
%%sql 

drop view if exists bank.distinct_users;

create view bank.distinct_users as
select 
   distinct account_id as Active_id, 
   Activity_year, 
   Activity_month, 
   Activity_month_number 
from bank.user_activity;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [393]:
%%sql
-- Check results
select * from bank.distinct_users
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(2378, '1993', 'January', '01'),
 (576, '1993', 'January', '01'),
 (704, '1993', 'January', '01'),
 (3818, '1993', 'January', '01'),
 (1972, '1993', 'January', '01'),
 (2632, '1993', 'January', '01'),
 (1539, '1993', 'January', '01'),
 (2484, '1993', 'January', '01'),
 (1695, '1993', 'January', '01'),
 (793, '1993', 'January', '01')]

</details>

Final step: Perform a self join for the previous view but with the following restrictions:
   *  The Active_id MUST exist in the second table
   *  The Activity_month should be shifted by one.

In [394]:
%%sql
select 
   d1.Activity_year,
   d1.Activity_month,
   d1.Activity_month_number,
   count(distinct d1.Active_id) as Retained_customers
   from bank.distinct_users as d1
join bank.distinct_users as d2
on d1.Active_id = d2.Active_id 
and d2.Activity_month_number = d1.Activity_month_number + 1 
group by d1.Activity_year, d1.Activity_month_number
order by d1.Activity_year, d1.Activity_month_number
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', '01', 93),
 ('1993', 'February', '02', 183),
 ('1993', 'March', '03', 281),
 ('1993', 'April', '04', 356),
 ('1993', 'May', '05', 446),
 ('1993', 'June', '06', 531),
 ('1993', 'July', '07', 624),
 ('1993', 'August', '08', 723),
 ('1993', 'September', '09', 828),
 ('1993', 'October', '10', 901)]

Creating a view to store the results of the previous query

In [395]:
%%sql
drop view if exists bank.retained_customers;
create view bank.retained_customers as 
select 
   d1.Activity_year,
   d1.Activity_month,
   count(distinct d1.Active_id) as Retained_customers
   from bank.distinct_users as d1
join bank.distinct_users as d2
on d1.Active_id = d2.Active_id 
and d2.Activity_month_number  = d1.Activity_month_number + 1
group by d1.Activity_year, d1.Activity_month_number
order by d1.Activity_year, d1.Activity_month_number
limit 10;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [396]:
%%sql
-- Checking the final results
select * from bank.retained_customers
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 93),
 ('1993', 'February', 183),
 ('1993', 'March', 281),
 ('1993', 'April', 356),
 ('1993', 'May', 446),
 ('1993', 'June', 531),
 ('1993', 'July', 624),
 ('1993', 'August', 723),
 ('1993', 'September', 828),
 ('1993', 'October', 901)]

# 3.07 Activity 2

Modify the previous queries to list the customers lost last month.

### Solution

Now we’ll take retention and turn it on its head: How many users last month did not come back this month?

We’ll use the same self join, except this time, we want to only include rows in last_month that do not have equivalents in this_month. Here’s the query:

In [397]:
%%sql
select * from bank.trans limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, '', '', 0),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, '', '', 0),
 (207264, 704, 930101, 'PRIJEM', 'VKLAD', 1000.0, 1000.0, '', '', 0),
 (1117247, 3818, 930101, 'PRIJEM', 'VKLAD', 600.0, 600.0, '', '', 0),
 (579373, 1972, 930102, 'PRIJEM', 'VKLAD', 400.0, 400.0, '', '', 0),
 (771035, 2632, 930102, 'PRIJEM', 'VKLAD', 1100.0, 1100.0, '', '', 0),
 (452728, 1539, 930103, 'PRIJEM', 'VKLAD', 600.0, 600.0, '', '', 0),
 (725751, 2484, 930103, 'PRIJEM', 'VKLAD', 1100.0, 1100.0, '', '', 0),
 (497211, 1695, 930103, 'PRIJEM', 'VKLAD', 200.0, 200.0, '', '', 0),
 (232960, 793, 930103, 'PRIJEM', 'VKLAD', 800.0, 800.0, '', '', 0)]

In [289]:
%%sql
delete from bank.trans 
where account_id=1539 and date_format(convert(date,date), '%M') = "September" 
and date_format(convert(date,date), '%Y') = "1994";

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.

[]

In [398]:
%%sql
drop view if exists bank.lost_customers;
create view bank.lost_customers as 
select 
   last_month.Activity_year,
   last_month.Activity_month,
   count(distinct last_month.Active_id) as Lost_customers
   from bank.distinct_users as last_month
left join bank.distinct_users as this_month
on last_month.Active_id = this_month.Active_id 
and this_month.Activity_month_number = last_month.Activity_month_number + 1
where this_month.Active_id is null
group by last_month.Activity_year, last_month.Activity_month_number
order by last_month.Activity_year, last_month.Activity_month_number
limit 10;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [399]:
%%sql
-- Checking the final results
select * from bank.lost_customers
limit 100;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'December', 1113),
 ('1994', 'December', 1560),
 ('1995', 'December', 2215),
 ('1996', 'February', 1),
 ('1996', 'May', 1),
 ('1996', 'August', 1),
 ('1996', 'September', 1),
 ('1996', 'November', 2),
 ('1996', 'December', 3548),
 ('1997', 'January', 1)]

### Lesson 3 key concepts

> :clock10: 20 min

Examples on `self joins` to perform calculations such as monthly customer retention/customer churn.

Compute the change in retained customers from month to month. Again, let's go step by step.

-- Step 1: Checking what we have.

<summary>Code Sample</summary>

- Step 1

In [400]:
%%sql
select * from retained_customers
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 93),
 ('1993', 'February', 183),
 ('1993', 'March', 281),
 ('1993', 'April', 356),
 ('1993', 'May', 446),
 ('1993', 'June', 531),
 ('1993', 'July', 624),
 ('1993', 'August', 723),
 ('1993', 'September', 828),
 ('1993', 'October', 901)]

- Step 2. Computing the differences between each month and restarted every year.

In [401]:
%%sql
select 
   Activity_year,
   Activity_month,
   Retained_customers, 
   lag(Retained_customers, 1) over(partition by Activity_year) as Lagged
from retained_customers
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', 93, None),
 ('1993', 'February', 183, 93),
 ('1993', 'March', 281, 183),
 ('1993', 'April', 356, 281),
 ('1993', 'May', 446, 356),
 ('1993', 'June', 531, 446),
 ('1993', 'July', 624, 531),
 ('1993', 'August', 723, 624),
 ('1993', 'September', 828, 723),
 ('1993', 'October', 901, 828)]

- Final Step: Computing column differrences.

In [402]:
%%sql
select
  Activity_year,
    Activity_month, 
   (Retained_customers-lag(Retained_customers, 1) over(partition by Activity_year)) as Diff
from retained_customers;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[('1993', 'January', None),
 ('1993', 'February', 90),
 ('1993', 'March', 98),
 ('1993', 'April', 75),
 ('1993', 'May', 90),
 ('1993', 'June', 85),
 ('1993', 'July', 93),
 ('1993', 'August', 99),
 ('1993', 'September', 105),
 ('1993', 'October', 73)]

# 3.07 Activity 3

Use a similar approach to get total monthly transaction per account and the difference with the previous month.

In [403]:
%%sql
select * from bank.trans limit 3;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(695247, 2378, 930101, 'PRIJEM', 'VKLAD', 700.0, 700.0, '', '', 0),
 (171812, 576, 930101, 'PRIJEM', 'VKLAD', 900.0, 900.0, '', '', 0),
 (207264, 704, 930101, 'PRIJEM', 'VKLAD', 1000.0, 1000.0, '', '', 0)]

In [404]:
%%sql
drop view if exists bank.num_transactions_per_account;

create view bank.num_transactions_per_account as
select account_id, count(trans_id) as num_transactions,
date_format(convert(date,date), '%Y') as year,
date_format(convert(date,date), '%M') as month,
date_format(convert(date,date), '%m') as month_number
from bank.trans
group by account_id, year, month_number
order by account_id, year, month_number;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [405]:
%%sql
select * from bank.num_transactions_per_account limit 20;

 * mysql+pymysql://root:***@localhost/bank
20 rows affected.

[(1, 1, '1995', 'March', '03'),
 (1, 3, '1995', 'April', '04'),
 (1, 3, '1995', 'May', '05'),
 (1, 3, '1995', 'June', '06'),
 (1, 3, '1995', 'July', '07'),
 (1, 4, '1995', 'August', '08'),
 (1, 4, '1995', 'September', '09'),
 (1, 4, '1995', 'October', '10'),
 (1, 6, '1995', 'November', '11'),
 (1, 4, '1995', 'December', '12'),
 (1, 10, '1996', 'January', '01'),
 (1, 4, '1996', 'February', '02'),
 (1, 5, '1996', 'March', '03'),
 (1, 3, '1996', 'April', '04'),
 (1, 5, '1996', 'May', '05'),
 (1, 5, '1996', 'June', '06'),
 (1, 5, '1996', 'July', '07'),
 (1, 5, '1996', 'August', '08'),
 (1, 3, '1996', 'September', '09'),
 (1, 4, '1996', 'October', '10')]

In [406]:
%%sql
select *, num_transactions - lag(num_transactions, 1) 
          over (partition by account_id order by year, month_number) as num_transactions_diff
from bank.num_transactions_per_account
order by account_id, year, month_number
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(1, 1, '1995', 'March', '03', None),
 (1, 3, '1995', 'April', '04', 2),
 (1, 3, '1995', 'May', '05', 0),
 (1, 3, '1995', 'June', '06', 0),
 (1, 3, '1995', 'July', '07', 0),
 (1, 4, '1995', 'August', '08', 1),
 (1, 4, '1995', 'September', '09', 0),
 (1, 4, '1995', 'October', '10', 0),
 (1, 6, '1995', 'November', '11', 2),
 (1, 4, '1995', 'December', '12', -2)]

We can follow a similar approach for the total monthly amount per account_id:

In [407]:
%%sql
drop view if exists bank.amount_transactions_per_account;

create view bank.amount_transactions_per_account as
select account_id, sum(amount) as amount_transactions,
date_format(convert(date,date), '%Y') as year,
date_format(convert(date,date), '%M') as month,
date_format(convert(date,date), '%m') as month_number
from bank.trans
group by account_id, year, month_number
order by account_id, year, month_number;

 * mysql+pymysql://root:***@localhost/bank
0 rows affected.
0 rows affected.

[]

In [408]:
%%sql
select * from bank.amount_transactions_per_account limit 5;

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(1, 1000.0, '1995', 'March', '03'),
 (1, 16298.20000076294, '1995', 'April', '04'),
 (1, 5858.0, '1995', 'May', '05'),
 (1, 3979.599998474121, '1995', 'June', '06'),
 (1, 9087.900001525879, '1995', 'July', '07')]

In [411]:
%%sql
select *, amount_transactions - lag(amount_transactions, 1) 
          over (partition by account_id order by year, month_number) as amount_transactions_diff
from bank.amount_transactions_per_account
order by account_id, year, month_number
limit 10;

 * mysql+pymysql://root:***@localhost/bank
10 rows affected.

[(1, 1000.0, '1995', 'March', '03', None),
 (1, 16298.20000076294, '1995', 'April', '04', 15298.20000076294),
 (1, 5858.0, '1995', 'May', '05', -10440.20000076294),
 (1, 3979.599998474121, '1995', 'June', '06', -1878.400001525879),
 (1, 9087.900001525879, '1995', 'July', '07', 5108.300003051758),
 (1, 11292.799997329712, '1995', 'August', '08', 2204.899995803833),
 (1, 4485.10000038147, '1995', 'September', '09', -6807.699996948242),
 (1, 6236.10000038147, '1995', 'October', '10', 1751.0),
 (1, 9000.799997329712, '1995', 'November', '11', 2764.699996948242),
 (1, 6750.0, '1995', 'December', '12', -2250.799997329712)]


# Lab | SQL Rolling calculations

In this lab, you will be using the [Sakila](https://dev.mysql.com/doc/sakila/en/) database of movie rentals.

### Instructions

1. Get number of monthly active customers.
2. Active users in the previous month.
3. Percentage change in the number of active customers.
4. Retained customers every month.

### Solution:

In [310]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)
%load_ext sql
%sql {connection_string}

 ······

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: root@bank'

In [324]:
%%sql
select * from sakila.rental limit 3

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(1, datetime.datetime(2005, 5, 24, 22, 53, 30), 367, 130, datetime.datetime(2005, 5, 26, 22, 4, 30), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (2, datetime.datetime(2005, 5, 24, 22, 54, 33), 1525, 459, datetime.datetime(2005, 5, 28, 19, 40, 33), 1, datetime.datetime(2006, 2, 15, 21, 30, 53)),
 (3, datetime.datetime(2005, 5, 24, 23, 3, 39), 1711, 408, datetime.datetime(2005, 6, 1, 22, 12, 39), 1, datetime.datetime(2006, 2, 15, 21, 30, 53))]

In [325]:
%%sql
-- 1 - Get number of monthly active customers

with customer_activity as (
  select customer_id, convert(rental_date, date) as Activity_date,
  date_format(convert(rental_date,date), '%Y') as Activity_year,
  date_format(convert(rental_date,date), '%M') as Activity_Month,
  date_format(convert(rental_date,date), '%m') as Activity_Month_Number
  from sakila.rental
)
select count(distinct customer_id) as Active_users, Activity_year, Activity_Month
from customer_activity
group by Activity_year, Activity_Month_Number
order by Activity_year, Activity_Month_Number

 * mysql+pymysql://root:***@localhost/bank
5 rows affected.

[(520, '2005', 'May'),
 (590, '2005', 'June'),
 (599, '2005', 'July'),
 (599, '2005', 'August'),
 (158, '2006', 'February')]

In [321]:
%%sql
-- 2 - Active users in the previous month

with customer_activity as (
  select customer_id, convert(rental_date, date) as Activity_date,
  date_format(convert(rental_date,date), '%Y') as Activity_year,
  date_format(convert(rental_date,date), '%M') as Activity_Month,
  date_format(convert(rental_date,date), '%m') as Activity_Month_Number
  from sakila.rental
),
monthly_active_users as (
  select count(distinct customer_id) as Active_users, Activity_year, Activity_Month_Number
  from customer_activity
  group by Activity_year, Activity_Month_Number
  order by Activity_year, Activity_Month_Number
),
cte_activity as (
  select Active_users, lag(Active_users,1) over (partition by Activity_year) as last_month, Activity_year, Activity_Month_Number  from monthly_active_users
)
select * from cte_activity
where last_month is not null

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(590, 520, '2005', '06'), (599, 590, '2005', '07'), (599, 599, '2005', '08')]

In [320]:
%%sql
-- 3 - Percentage change in the number of active customers

with customer_activity as (
  select customer_id, convert(rental_date, date) as Activity_date,
  date_format(convert(rental_date,date), '%Y') as Activity_year,
  date_format(convert(rental_date,date), '%M') as Activity_Month,
  date_format(convert(rental_date,date), '%m') as Activity_Month_Number
  from sakila.rental
),
monthly_active_users as (
  select count(distinct customer_id) as Active_users, Activity_year, Activity_Month_Number
  from customer_activity
  group by Activity_year, Activity_Month_Number
  order by Activity_year, Activity_Month_Number
),
cte_activity as (
  select Active_users, lag(Active_users,1) over (partition by Activity_year) as last_month, Activity_year, Activity_Month_Number
  from monthly_active_users
)
select (Active_users-last_month)/Active_users*100 as percentage_change, Activity_year, Activity_Month_Number
from cte_activity
where last_month is not null;

 * mysql+pymysql://root:***@localhost/bank
3 rows affected.

[(Decimal('11.8644'), '2005', '06'),
 (Decimal('1.5025'), '2005', '07'),
 (Decimal('0.0000'), '2005', '08')]

In [ ]:
-- 4 - Retained customers every month

with customer_activity as (
  select customer_id, convert(rental_date, date) as Activity_date,
  date_format(convert(rental_date,date), '%M') as Activity_Month,
  date_format(convert(rental_date,date), '%Y') as Activity_year,
  convert(date_format(convert(rental_date,date), '%m'), UNSIGNED) as month_number
  from sakila.rental
),
distinct_users as (
  select distinct customer_id , Activity_month, Activity_year, month_number
  from customer_activity
)
select count(distinct d1.customer_id) as Retained_customers, d1.Activity_month, d1.Activity_year
from distinct_users d1
join distinct_users d2
on d1.customer_id = d2.customer_id and d1.month_number = d2.month_number + 1
group by d1.Activity_month, d1.Activity_year
order by d1.Activity_year, d1.month_number;